### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_pd = pd.read_csv(file_to_load)
purchase_data_df = pd.DataFrame(purchase_data_pd)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [2]:
# Total Number of Players
total_players = purchase_data_pd["SN"].count()
total_players

780

In [3]:
# Number of unique items

Unique_item_id = len(purchase_data_pd["Item ID"].unique())
Unique_item_id

183

In [4]:
# Total Purchase count

total_purchases = purchase_data_pd["Purchase ID"].count()
total_purchases

780

In [5]:
# Total Revenue

total_revenue = purchase_data_pd["Price"].sum()
total_revenue

2379.77

In [6]:
# Average Price

#Alternative: Average_Price = purchase_data_pd["Price"].mean()

Average_Price = total_revenue/total_purchases
Average_Price

3.0509871794871795

In [7]:
# Display of the data frame

P_Analysis_df = pd.DataFrame([{"Number of Unique Items": Unique_item_id,
                               "Average Price": Average_Price,
                               "Number of Purchases": total_purchases,
                              "Total Revenue":total_revenue}])
P_Analysis_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

In [8]:
P_Analysis_df["Average Price"] = P_Analysis_df["Average Price"].map("${:,.2f}".format)
P_Analysis_df["Total Revenue"] = P_Analysis_df["Total Revenue"].map("${:,.2f}".format)
P_Analysis_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [9]:
#show data frame again

purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
gender_count_df = purchase_data_df.groupby(by='Gender').count()
gender_count_df

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [11]:
Sum = purchase_data_df['Gender'].count()
Sum

780

In [12]:
Droped_Sum_df = gender_count_df.drop(columns = ['SN' , 'Age' , 'Item ID' , 'Item Name', 'Price'])
Droped_Sum_df

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [13]:
new_df = gender_count_df / Sum
new_df

,Purchase ID,SN,Age,Item ID,Item Name,Price
Gender,,,,,,
Female,0.144872,0.144872,0.144872,0.144872,0.144872,0.144872
Male,0.835897,0.835897,0.835897,0.835897,0.835897,0.835897
Other / Non-Disclosed,0.019231,0.019231,0.019231,0.019231,0.019231,0.019231

In [14]:
Droped_new_df = new_df.drop(columns = ['SN' , 'Age' , 'Item ID' , 'Item Name', 'Price'])
Droped_new_df

                       Purchase ID
Gender
Female                    0.144872
Male                      0.835897
Other / Non-Disclosed     0.019231

In [15]:
Droped_new_df['Purchase ID'] = Droped_new_df['Purchase ID'].mul(100).astype(int).astype(str).add('%')
Droped_new_df

                      Purchase ID
Gender
Female                        14%
Male                          83%
Other / Non-Disclosed          1%

In [16]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [17]:
cut_sum = purchase_data_df.drop(columns = ['SN' , 'Age' , 'Item ID' , 'Item Name', 'Price'])
cut_sum

     Purchase ID  Gender
0              0    Male
1              1    Male
2              2    Male
3              3    Male
4              4    Male
..           ...     ...
775          775  Female
776          776    Male
777          777    Male
778          778    Male
779          779    Male

[780 rows x 2 columns]

In [18]:
Sum_df_I = cut_sum.groupby(by='Gender').count()
Sum_df_I

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [19]:
New_df_display_df = pd.merge(Sum_df_I, Droped_new_df, on = 'Gender' , how = 'outer')
New_df_display_df

                       Purchase ID_x Purchase ID_y
Gender
Female                           113           14%
Male                             652           83%
Other / Non-Disclosed             15            1%

In [20]:
Final_df = New_df_display_df.rename(columns = {"Purchase ID_x": "Total Count", "Purchase ID_y": "Percentage of Players"})
Final_df

                       Total Count Percentage of Players
Gender
Female                         113                   14%
Male                           652                   83%
Other / Non-Disclosed           15                    1%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [21]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [22]:
Gender_Grouped_df = purchase_data_df.groupby(['Gender'])
Gender_Grouped_df

In [23]:
Purchase_Count = Gender_Grouped_df["Purchase ID"].count()

Purchase_Count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [24]:
total_value = Gender_Grouped_df['Price'].sum()
total_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [25]:
# Total purchase with dollar sign

sign_total_value  = total_value.map("${:,.2f}".format)
sign_total_value

Gender
Female                     $361.94
Male                     $1,967.64
Other / Non-Disclosed       $50.19
Name: Price, dtype: object

In [26]:
# avg purchase 

avg_purchase = Gender_Grouped_df['Price'].mean()
avg_purchase

avg_purchase_dec = avg_purchase.map("${:,.2f}".format)
avg_purchase_dec

Gender
Female                   $3.20
Male                     $3.02
Other / Non-Disclosed    $3.35
Name: Price, dtype: object

In [27]:
# Avg Total Purchase per Person

Group_by_person = purchase_data_df.groupby(['Gender', 'SN'])
Group_by_person

In [28]:
per_person = Group_by_person["Price"].sum()
per_person

Gender                 SN
Female                 Adastirin33      4.48
                       Aerithllora36    8.64
                       Aethedru70       3.54
                       Aidain51         3.45
                       Aiduesu86        4.48
                                        ...
Other / Non-Disclosed  Lirtim36         1.33
                       Maluncil97       5.28
                       Rairith81        2.22
                       Siarithria38     6.91
                       Sundim98         4.75
Name: Price, Length: 576, dtype: float64

In [29]:
Sum_pp = per_person.groupby('Gender').sum()
Sum_pp

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [30]:
count_pp = per_person.groupby('Gender').count()
count_pp

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: Price, dtype: int64

In [31]:
Normalized = Sum_pp / count_pp
Normalized

# Make it with $ sign

Normalized_d = Normalized.map("${:,.2f}".format)
Normalized_d

Gender
Female                   $4.47
Male                     $4.07
Other / Non-Disclosed    $4.56
Name: Price, dtype: object

In [32]:
organized_df = pd.DataFrame()
organized_df["Purchase Count"] = Purchase_Count
organized_df["Average Purchase Price"] =  avg_purchase_dec
organized_df["Total Purchase Value"] =  sign_total_value
organized_df["Avg Total Purchase per Person"] = Normalized_d

organized_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [33]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [34]:
purchase_data_df["Age"].max()

45

In [35]:
purchase_data_df["Age"].min()

7

In [36]:
bins = [0, 9.99, 14.99, 19.99, 24.99, 29.99, 34.99, 39.99, 999]

In [37]:
# naming my bins

Group_names = ['<10' , '10-14' , '15-19' , '20-24' , '25-29', '30-34' , '35-39' , '40+' ]

In [38]:
purchase_data_df['Age Group'] = pd.cut(purchase_data_df.Age,bins, labels = Group_names)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [39]:
purchase_data_df = purchase_data_df.groupby(['Age Group'])

In [40]:
count_table = purchase_data_df.count()
count_table

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Group
<10                 23   23   23      23       23         23     23
10-14               28   28   28      28       28         28     28
15-19              136  136  136     136      136        136    136
20-24              365  365  365     365      365        365    365
25-29              101  101  101     101      101        101    101
30-34               73   73   73      73       73         73     73
35-39               41   41   41      41       41         41     41
40+                 13   13   13      13       13         13     13

In [53]:
# For Purchasing Analysis (Age)

sum_table = purchase_data_df.sum()
sum_table

           Purchase ID   Age  Item ID    Price
Age Group
<10              10009   181     2437    77.13
10-14            10114   319     2887    82.78
15-19            54859  2284    12798   412.89
20-24           139573  7971    32411  1114.06
25-29            41072  2626     9146   293.00
30-34            26254  2291     6875   214.00
35-39            16596  1505     4137   147.67
40+               5333   540     1158    38.24

In [ ]:
# For Purchasing Analysis (Age)

In [41]:
Drop_age_count = count_table.drop(columns = ['SN', 'Age' , 'Gender' , 'Item ID', 'Item Name', 'Price'])
Drop_age_count

           Purchase ID
Age Group
<10                 23
10-14               28
15-19              136
20-24              365
25-29              101
30-34               73
35-39               41
40+                 13

In [42]:
new_table_age = (count_table / total_players)*100
new_table_age

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
Age Group,,,,,,,
<10,2.948718,2.948718,2.948718,2.948718,2.948718,2.948718,2.948718
10-14,3.589744,3.589744,3.589744,3.589744,3.589744,3.589744,3.589744
15-19,17.435897,17.435897,17.435897,17.435897,17.435897,17.435897,17.435897
20-24,46.794872,46.794872,46.794872,46.794872,46.794872,46.794872,46.794872
25-29,12.948718,12.948718,12.948718,12.948718,12.948718,12.948718,12.948718
30-34,9.358974,9.358974,9.358974,9.358974,9.358974,9.358974,9.358974
35-39,5.256410,5.256410,5.256410,5.256410,5.256410,5.256410,5.256410
40+,1.666667,1.666667,1.666667,1.666667,1.666667,1.666667,1.666667

In [43]:
Drop_Percentages = new_table_age.drop(columns = ['Age', 'Gender' , 'Item ID', 'Item Name' , 'Price' , 'SN'])
Drop_Percentages

           Purchase ID
Age Group
<10           2.948718
10-14         3.589744
15-19        17.435897
20-24        46.794872
25-29        12.948718
30-34         9.358974
35-39         5.256410
40+           1.666667

In [44]:
Drop_Percentages['Purchase ID'] = Drop_Percentages['Purchase ID'].map("{:,.2f}%".format)
Drop_Percentages

          Purchase ID
Age Group
<10             2.95%
10-14           3.59%
15-19          17.44%
20-24          46.79%
25-29          12.95%
30-34           9.36%
35-39           5.26%
40+             1.67%

In [45]:
Age_display_df = pd.merge(Drop_Percentages, Drop_age_count, on = 'Age Group' , how = 'outer')
Age_display_df

          Purchase ID_x  Purchase ID_y
Age Group
<10               2.95%             23
10-14             3.59%             28
15-19            17.44%            136
20-24            46.79%            365
25-29            12.95%            101
30-34             9.36%             73
35-39             5.26%             41
40+               1.67%             13

In [46]:
Final_Age_df = Age_display_df.rename(columns = {"Purchase ID_x": "Percentage of Players", "Purchase ID_y": "Total Count"})
Final_Age_df

          Percentage of Players  Total Count
Age Group
<10                       2.95%           23
10-14                     3.59%           28
15-19                    17.44%          136
20-24                    46.79%          365
25-29                    12.95%          101
30-34                     9.36%           73
35-39                     5.26%           41
40+                       1.67%           13

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [54]:
# this analysis and others are in the other python folder.

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [ ]:
# this analysis and others are in the other python folder.

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [55]:
# this analysis and others are in the other python folder.

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [56]:
# this analysis and others are in the other python folder.